/*
给n个slots，让插入一个广告x，保证x之间的gap大于一个值k，用dp秒之，和house robber有点像,
但hourse robber是求最大值, 这题是求方案总数, 方案总数和最大值一个是取max, 一个是取sum
Ad Fatigue是插入广告x，可以0个或多个，求问一共有多少种插入方法

就是比如3个slot _ _ _ 
gap是1 
你可以这么放 
x _ x 
x _ _ 
_ x _ 
_ _ x 
_ _ _ 
一共5种

f[i]: 前i个位置时能有多少种放法
f[0] = 0
f[i] = f[i-k] + f[i-1]

n=3,k=1
f[0] = 0
f[1] = 1
f[2] = f[1] + f[1] = 2
f[3] = f[3-1] + f[3-1] = f[2] + f[2] = 4
最后再加上空集的1, 共5种

n=3,k=2
x__
__x
___
f[0]=0
f[1]=1
f[2]=f[2-2]+f[2-1]=f[0]+f[1]=1
f[3]=f[3-2]+f[3-1]=f[1]+f[2]=2
最后加上空集的1, 共3种
*/

